# Iterate Over

In [25]:
import pandas as pd

In [3]:
data={
    'Company':['IBM','HP','L&T','TCS','CAPGEMINI','WIPRO'],
    'CEO':['XYZ','XYZ','Sanjay Mehta','Ratan Tata','XYZ','Thiorrie Daolaporte'],
    'HEADQUARTERS':['USA','USA','INDIA','INDIA','FRANCE','INDIA']
}

In [6]:
tech_company_df=pd.DataFrame(data)
tech_company_df

     Company                  CEO HEADQUARTERS
0        IBM                  XYZ          USA
1         HP                  XYZ          USA
2        L&T         Sanjay Mehta        INDIA
3        TCS           Ratan Tata        INDIA
4  CAPGEMINI                  XYZ       FRANCE
5      WIPRO  Thiorrie Daolaporte        INDIA

In [7]:
for row in tech_company_df.itertuples():
    print(row)

Pandas(Index=0, Company='IBM', CEO='XYZ', HEADQUARTERS='USA')
Pandas(Index=1, Company='HP', CEO='XYZ', HEADQUARTERS='USA')
Pandas(Index=2, Company='L&T', CEO='Sanjay Mehta', HEADQUARTERS='INDIA')
Pandas(Index=3, Company='TCS', CEO='Ratan Tata', HEADQUARTERS='INDIA')
Pandas(Index=4, Company='CAPGEMINI', CEO='XYZ', HEADQUARTERS='FRANCE')
Pandas(Index=5, Company='WIPRO', CEO='Thiorrie Daolaporte', HEADQUARTERS='INDIA')

In [8]:
for row in tech_company_df.itertuples():
    print('Company: ',row.Company)
    print('Headquarters: ',row.HEADQUARTERS,'\n')

Company:  IBM
Headquarters:  USA

Company:  HP
Headquarters:  USA

Company:  L&T
Headquarters:  INDIA

Company:  TCS
Headquarters:  INDIA

Company:  CAPGEMINI
Headquarters:  FRANCE

Company:  WIPRO
Headquarters:  INDIA

In [14]:
for row_index,row in tech_company_df.iterrows():
    print('Row Index: ',row_index)
    print('Company Name: ',row[0])
    print('Company CEO: ',row[1],'\n')

Row Index:  0
Company Name:  IBM
Company CEO:  XYZ

Row Index:  1
Company Name:  HP
Company CEO:  XYZ

Row Index:  2
Company Name:  L&T
Company CEO:  Sanjay Mehta

Row Index:  3
Company Name:  TCS
Company CEO:  Ratan Tata

Row Index:  4
Company Name:  CAPGEMINI
Company CEO:  XYZ

Row Index:  5
Company Name:  WIPRO
Company CEO:  Thiorrie Daolaporte

In [16]:
for key,value in tech_company_df.iteritems():
    print('Key is: ',key)
    print('Value is:',value,'\n')

Key is:  Company
Value is: 0          IBM
1           HP
2          L&T
3          TCS
4    CAPGEMINI
5        WIPRO
Name: Company, dtype: object

Key is:  CEO
Value is: 0                    XYZ
1                    XYZ
2           Sanjay Mehta
3             Ratan Tata
4                    XYZ
5    Thiorrie Daolaporte
Name: CEO, dtype: object

Key is:  HEADQUARTERS
Value is: 0       USA
1       USA
2     INDIA
3     INDIA
4    FRANCE
5     INDIA
Name: HEADQUARTERS, dtype: object

# Export to Excel - txt

In [17]:
data={
    'Company':['IBM','HP','L&T','TCS','CAPGEMINI','WIPRO'],
    'CEO':['XYZ','XYZ','Sanjay Mehta','Ratan Tata','XYZ','Thiorrie Daolaporte'],
    'HEADQUARTERS':['USA','USA','INDIA','INDIA','FRANCE','INDIA']
}
tech_company_df=pd.DataFrame(data)
tech_company_df

     Company                  CEO HEADQUARTERS
0        IBM                  XYZ          USA
1         HP                  XYZ          USA
2        L&T         Sanjay Mehta        INDIA
3        TCS           Ratan Tata        INDIA
4  CAPGEMINI                  XYZ       FRANCE
5      WIPRO  Thiorrie Daolaporte        INDIA

In [32]:
tech_company_df.to_csv('C:/Destination/Tech_Companies.txt',index=False)

In [30]:
! pip install openpyxl

Collecting openpyxl

WARNING: You are using pip version 20.2.4; however, version 21.2.4 is available.
You should consider upgrading via the 'c:\users\admin\appdata\local\programs\python\python37\python.exe -m pip install --upgrade pip' command.

  Downloading openpyxl-3.0.8-py2.py3-none-any.whl (244 kB)
Collecting et-xmlfile
  Using cached et_xmlfile-1.1.0-py3-none-any.whl (4.7 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-1.1.0 openpyxl-3.0.8

# Sorting

In [33]:
unsorted_data=pd.read_csv('C:/countries/countries of the world.csv')

In [34]:
unsorted_data=unsorted_data[:15]
unsorted_data.index=[4,6,5,3,2,1,8,9,9,14,7,10,11,12,0]
sorted_data=unsorted_data.sort_index()
sorted_data

,Country,Region,Population,Area (sq. mi.),Pop. Density (per sq. mi.),Coastline (coast/area ratio),Net migration,Infant mortality (per 1000 births),GDP ($ per capita),Literacy (%),Phones (per 1000),Arable (%),Crops (%),Other (%),Climate,Birthrate,Deathrate,Agriculture,Industry,Service
0,"Bahamas, The",LATIN AMER. & CARIB,303770,13940,"21,8","25,41","-2,2","25,21",16700.0,"95,6","460,6","0,8","0,4","98,8",2,"17,57","9,05","0,03","0,07","0,9"
1,Angola,SUB-SAHARAN AFRICA,12127071,1246700,"9,7","0,13",0,"191,19",1900.0,"42,0","7,8","2,41","0,24","97,35",NaN,"45,11","24,2","0,096","0,658","0,246"
2,Andorra,WESTERN EUROPE,71201,468,"152,1","0,00","6,6","4,05",19000.0,"100,0","497,2","2,22",0,"97,78",3,"8,71","6,25",NaN,NaN,NaN
3,American Samoa,OCEANIA,57794,199,"290,4","58,29","-20,71","9,27",8000.0,"97,0","259,5",10,15,75,2,"22,46","3,27",NaN,NaN,NaN
4,Afghanistan,ASIA (EX. NEAR EAST),31056997,647500,"48,0","0,00","23,06","163,07",700.0,"36,0","3,2","12,13","0,22","87,65",1,"46,6","20,34","0,38","0,24","0,38"
5,Algeria,NORTHERN AFRICA,32930091,2381740,"13,8","0,04","-0,39",31,6000.0,"70,0","78,1","3,22","0,25","96,53",1,"17,14","4,61","0,101","0,6","0,298"
6,Albania,EASTERN EUROPE,3581655,28748,"124,6","1,26","-4,93","21,52",4500.0,"86,5","71,2","21,09","4,42","74,49",3,"15,11","5,22","0,232","0,188","0,579"
7,Aruba,LATIN AMER. & CARIB,71891,193,"372,5","35,49",0,"5,89",28000.0,"97,0","516,1","10,53",0,"89,47",2,"11,03","6,68","0,004","0,333","0,663"
8,Anguilla,LATIN AMER. & CARIB,13477,102,"132,1","59,80","10,76","21,03",8600.0,"95,0","460,0",0,0,100,2,"14,17","5,34","0,04","0,18","0,78"
9,Antigua & Barbuda,LATIN AMER. & CARIB,69108,443,"156,0","34,54","-6,15","19,46",11000.0,"89,0","549,9","18,18","4,55","77,27",2,"16,93","5,37","0,038","0,22","0,743"
9,Argentina,LATIN AMER. & CARIB,39921833,2766890,"14,4","0,18","0,61","15,18",11200.0,"97,1","220,4","12,31","0,48","87,21",3,"16,73","7,55","0,095","0,358","0,547"
10,Australia,OCEANIA,20264082,7686850,"2,6","0,34","3,98","4,69",29000.0,"100,0","565,5","6,55","0,04","93,41",1,"12,14","7,51","0,038","0,262","0,7"
11,Austria,WESTERN EUROPE,8192880,83870,"97,7","0,00",2,"4,66",30000.0,"98,0","452,2","16,91","0,86","82,23",3,"8,74","9,76","0,018","0,304","0,678"
12,Azerbaijan,C.W. OF IND. STATES,7961619,86600,"91,9","0,00","-4,9","81,74",3400.0,"97,0","137,1","19,63","2,71","77,66",1,"20,74","9,75","0,141","0,457","0,402"
14,Armenia,C.W. OF IND. STATES,2976372,29800,"99,9","0,00","-6,47","23,28",3500.0,"98,6","195,7","17,55","2,3","80,15",4,"12,07","8,23","0,239","0,343","0,418"

In [35]:
unsorted_data

,Country,Region,Population,Area (sq. mi.),Pop. Density (per sq. mi.),Coastline (coast/area ratio),Net migration,Infant mortality (per 1000 births),GDP ($ per capita),Literacy (%),Phones (per 1000),Arable (%),Crops (%),Other (%),Climate,Birthrate,Deathrate,Agriculture,Industry,Service
4,Afghanistan,ASIA (EX. NEAR EAST),31056997,647500,"48,0","0,00","23,06","163,07",700.0,"36,0","3,2","12,13","0,22","87,65",1,"46,6","20,34","0,38","0,24","0,38"
6,Albania,EASTERN EUROPE,3581655,28748,"124,6","1,26","-4,93","21,52",4500.0,"86,5","71,2","21,09","4,42","74,49",3,"15,11","5,22","0,232","0,188","0,579"
5,Algeria,NORTHERN AFRICA,32930091,2381740,"13,8","0,04","-0,39",31,6000.0,"70,0","78,1","3,22","0,25","96,53",1,"17,14","4,61","0,101","0,6","0,298"
3,American Samoa,OCEANIA,57794,199,"290,4","58,29","-20,71","9,27",8000.0,"97,0","259,5",10,15,75,2,"22,46","3,27",NaN,NaN,NaN
2,Andorra,WESTERN EUROPE,71201,468,"152,1","0,00","6,6","4,05",19000.0,"100,0","497,2","2,22",0,"97,78",3,"8,71","6,25",NaN,NaN,NaN
1,Angola,SUB-SAHARAN AFRICA,12127071,1246700,"9,7","0,13",0,"191,19",1900.0,"42,0","7,8","2,41","0,24","97,35",NaN,"45,11","24,2","0,096","0,658","0,246"
8,Anguilla,LATIN AMER. & CARIB,13477,102,"132,1","59,80","10,76","21,03",8600.0,"95,0","460,0",0,0,100,2,"14,17","5,34","0,04","0,18","0,78"
9,Antigua & Barbuda,LATIN AMER. & CARIB,69108,443,"156,0","34,54","-6,15","19,46",11000.0,"89,0","549,9","18,18","4,55","77,27",2,"16,93","5,37","0,038","0,22","0,743"
9,Argentina,LATIN AMER. & CARIB,39921833,2766890,"14,4","0,18","0,61","15,18",11200.0,"97,1","220,4","12,31","0,48","87,21",3,"16,73","7,55","0,095","0,358","0,547"
14,Armenia,C.W. OF IND. STATES,2976372,29800,"99,9","0,00","-6,47","23,28",3500.0,"98,6","195,7","17,55","2,3","80,15",4,"12,07","8,23","0,239","0,343","0,418"
7,Aruba,LATIN AMER. & CARIB,71891,193,"372,5","35,49",0,"5,89",28000.0,"97,0","516,1","10,53",0,"89,47",2,"11,03","6,68","0,004","0,333","0,663"
10,Australia,OCEANIA,20264082,7686850,"2,6","0,34","3,98","4,69",29000.0,"100,0","565,5","6,55","0,04","93,41",1,"12,14","7,51","0,038","0,262","0,7"
11,Austria,WESTERN EUROPE,8192880,83870,"97,7","0,00",2,"4,66",30000.0,"98,0","452,2","16,91","0,86","82,23",3,"8,74","9,76","0,018","0,304","0,678"
12,Azerbaijan,C.W. OF IND. STATES,7961619,86600,"91,9","0,00","-4,9","81,74",3400.0,"97,0","137,1","19,63","2,71","77,66",1,"20,74","9,75","0,141","0,457","0,402"
0,"Bahamas, The",LATIN AMER. & CARIB,303770,13940,"21,8","25,41","-2,2","25,21",16700.0,"95,6","460,6","0,8","0,4","98,8",2,"17,57","9,05","0,03","0,07","0,9"

In [36]:
unsorted_data.sort_index(axis=1)

,Agriculture,Arable (%),Area (sq. mi.),Birthrate,Climate,Coastline (coast/area ratio),Country,Crops (%),Deathrate,GDP ($ per capita),Industry,Infant mortality (per 1000 births),Literacy (%),Net migration,Other (%),Phones (per 1000),Pop. Density (per sq. mi.),Population,Region,Service
4,"0,38","12,13",647500,"46,6",1,"0,00",Afghanistan,"0,22","20,34",700.0,"0,24","163,07","36,0","23,06","87,65","3,2","48,0",31056997,ASIA (EX. NEAR EAST),"0,38"
6,"0,232","21,09",28748,"15,11",3,"1,26",Albania,"4,42","5,22",4500.0,"0,188","21,52","86,5","-4,93","74,49","71,2","124,6",3581655,EASTERN EUROPE,"0,579"
5,"0,101","3,22",2381740,"17,14",1,"0,04",Algeria,"0,25","4,61",6000.0,"0,6",31,"70,0","-0,39","96,53","78,1","13,8",32930091,NORTHERN AFRICA,"0,298"
3,NaN,10,199,"22,46",2,"58,29",American Samoa,15,"3,27",8000.0,NaN,"9,27","97,0","-20,71",75,"259,5","290,4",57794,OCEANIA,NaN
2,NaN,"2,22",468,"8,71",3,"0,00",Andorra,0,"6,25",19000.0,NaN,"4,05","100,0","6,6","97,78","497,2","152,1",71201,WESTERN EUROPE,NaN
1,"0,096","2,41",1246700,"45,11",NaN,"0,13",Angola,"0,24","24,2",1900.0,"0,658","191,19","42,0",0,"97,35","7,8","9,7",12127071,SUB-SAHARAN AFRICA,"0,246"
8,"0,04",0,102,"14,17",2,"59,80",Anguilla,0,"5,34",8600.0,"0,18","21,03","95,0","10,76",100,"460,0","132,1",13477,LATIN AMER. & CARIB,"0,78"
9,"0,038","18,18",443,"16,93",2,"34,54",Antigua & Barbuda,"4,55","5,37",11000.0,"0,22","19,46","89,0","-6,15","77,27","549,9","156,0",69108,LATIN AMER. & CARIB,"0,743"
9,"0,095","12,31",2766890,"16,73",3,"0,18",Argentina,"0,48","7,55",11200.0,"0,358","15,18","97,1","0,61","87,21","220,4","14,4",39921833,LATIN AMER. & CARIB,"0,547"
14,"0,239","17,55",29800,"12,07",4,"0,00",Armenia,"2,3","8,23",3500.0,"0,343","23,28","98,6","-6,47","80,15","195,7","99,9",2976372,C.W. OF IND. STATES,"0,418"
7,"0,004","10,53",193,"11,03",2,"35,49",Aruba,0,"6,68",28000.0,"0,333","5,89","97,0",0,"89,47","516,1","372,5",71891,LATIN AMER. & CARIB,"0,663"
10,"0,038","6,55",7686850,"12,14",1,"0,34",Australia,"0,04","7,51",29000.0,"0,262","4,69","100,0","3,98","93,41","565,5","2,6",20264082,OCEANIA,"0,7"
11,"0,018","16,91",83870,"8,74",3,"0,00",Austria,"0,86","9,76",30000.0,"0,304","4,66","98,0",2,"82,23","452,2","97,7",8192880,WESTERN EUROPE,"0,678"
12,"0,141","19,63",86600,"20,74",1,"0,00",Azerbaijan,"2,71","9,75",3400.0,"0,457","81,74","97,0","-4,9","77,66","137,1","91,9",7961619,C.W. OF IND. STATES,"0,402"
0,"0,03","0,8",13940,"17,57",2,"25,41","Bahamas, The","0,4","9,05",16700.0,"0,07","25,21","95,6","-2,2","98,8","460,6","21,8",303770,LATIN AMER. & CARIB,"0,9"

In [37]:
sorted_data['Agriculture'].sort_index()

0      0,03
1     0,096
2       NaN
3       NaN
4      0,38
5     0,101
6     0,232
7     0,004
8      0,04
9     0,038
9     0,095
10    0,038
11    0,018
12    0,141
14    0,239
Name: Agriculture, dtype: object

In [41]:
unsorted_data.sort_values(by='Area (sq. mi.)')

,Country,Region,Population,Area (sq. mi.),Pop. Density (per sq. mi.),Coastline (coast/area ratio),Net migration,Infant mortality (per 1000 births),GDP ($ per capita),Literacy (%),Phones (per 1000),Arable (%),Crops (%),Other (%),Climate,Birthrate,Deathrate,Agriculture,Industry,Service
8,Anguilla,LATIN AMER. & CARIB,13477,102,"132,1","59,80","10,76","21,03",8600.0,"95,0","460,0",0,0,100,2,"14,17","5,34","0,04","0,18","0,78"
7,Aruba,LATIN AMER. & CARIB,71891,193,"372,5","35,49",0,"5,89",28000.0,"97,0","516,1","10,53",0,"89,47",2,"11,03","6,68","0,004","0,333","0,663"
3,American Samoa,OCEANIA,57794,199,"290,4","58,29","-20,71","9,27",8000.0,"97,0","259,5",10,15,75,2,"22,46","3,27",NaN,NaN,NaN
9,Antigua & Barbuda,LATIN AMER. & CARIB,69108,443,"156,0","34,54","-6,15","19,46",11000.0,"89,0","549,9","18,18","4,55","77,27",2,"16,93","5,37","0,038","0,22","0,743"
2,Andorra,WESTERN EUROPE,71201,468,"152,1","0,00","6,6","4,05",19000.0,"100,0","497,2","2,22",0,"97,78",3,"8,71","6,25",NaN,NaN,NaN
0,"Bahamas, The",LATIN AMER. & CARIB,303770,13940,"21,8","25,41","-2,2","25,21",16700.0,"95,6","460,6","0,8","0,4","98,8",2,"17,57","9,05","0,03","0,07","0,9"
6,Albania,EASTERN EUROPE,3581655,28748,"124,6","1,26","-4,93","21,52",4500.0,"86,5","71,2","21,09","4,42","74,49",3,"15,11","5,22","0,232","0,188","0,579"
14,Armenia,C.W. OF IND. STATES,2976372,29800,"99,9","0,00","-6,47","23,28",3500.0,"98,6","195,7","17,55","2,3","80,15",4,"12,07","8,23","0,239","0,343","0,418"
11,Austria,WESTERN EUROPE,8192880,83870,"97,7","0,00",2,"4,66",30000.0,"98,0","452,2","16,91","0,86","82,23",3,"8,74","9,76","0,018","0,304","0,678"
12,Azerbaijan,C.W. OF IND. STATES,7961619,86600,"91,9","0,00","-4,9","81,74",3400.0,"97,0","137,1","19,63","2,71","77,66",1,"20,74","9,75","0,141","0,457","0,402"
4,Afghanistan,ASIA (EX. NEAR EAST),31056997,647500,"48,0","0,00","23,06","163,07",700.0,"36,0","3,2","12,13","0,22","87,65",1,"46,6","20,34","0,38","0,24","0,38"
1,Angola,SUB-SAHARAN AFRICA,12127071,1246700,"9,7","0,13",0,"191,19",1900.0,"42,0","7,8","2,41","0,24","97,35",NaN,"45,11","24,2","0,096","0,658","0,246"
5,Algeria,NORTHERN AFRICA,32930091,2381740,"13,8","0,04","-0,39",31,6000.0,"70,0","78,1","3,22","0,25","96,53",1,"17,14","4,61","0,101","0,6","0,298"
9,Argentina,LATIN AMER. & CARIB,39921833,2766890,"14,4","0,18","0,61","15,18",11200.0,"97,1","220,4","12,31","0,48","87,21",3,"16,73","7,55","0,095","0,358","0,547"
10,Australia,OCEANIA,20264082,7686850,"2,6","0,34","3,98","4,69",29000.0,"100,0","565,5","6,55","0,04","93,41",1,"12,14","7,51","0,038","0,262","0,7"

In [42]:
unsorted_data[['Agriculture','Country','Population','Net migration','Climate']].sort_values(by='Climate')

   Agriculture             Country  Population Net migration Climate
4         0,38        Afghanistan     31056997         23,06       1
5        0,101            Algeria     32930091         -0,39       1
10       0,038          Australia     20264082          3,98       1
12       0,141         Azerbaijan      7961619          -4,9       1
3          NaN     American Samoa        57794        -20,71       2
8         0,04           Anguilla        13477         10,76       2
9        0,038  Antigua & Barbuda        69108         -6,15       2
7        0,004              Aruba        71891             0       2
0         0,03       Bahamas, The       303770          -2,2       2
6        0,232            Albania      3581655         -4,93       3
2          NaN            Andorra        71201           6,6       3
9        0,095          Argentina     39921833          0,61       3
11       0,018            Austria      8192880             2       3
14       0,239            Armenia      2976372         -6,47       4
1        0,096             Angola     12127071             0     NaN

# Data Missing

In [56]:
unsorted_data=pd.read_csv('C:/countries/countries of the world.csv')
unsorted_data

,Country,Region,Population,Area (sq. mi.),Pop. Density (per sq. mi.),Coastline (coast/area ratio),Net migration,Infant mortality (per 1000 births),GDP ($ per capita),Literacy (%),Phones (per 1000),Arable (%),Crops (%),Other (%),Climate,Birthrate,Deathrate,Agriculture,Industry,Service
0,Afghanistan,ASIA (EX. NEAR EAST),31056997,647500,"48,0","0,00","23,06","163,07",700.0,"36,0","3,2","12,13","0,22","87,65",1,"46,6","20,34","0,38","0,24","0,38"
1,Albania,EASTERN EUROPE,3581655,28748,"124,6","1,26","-4,93","21,52",4500.0,"86,5","71,2","21,09","4,42","74,49",3,"15,11","5,22","0,232","0,188","0,579"
2,Algeria,NORTHERN AFRICA,32930091,2381740,"13,8","0,04","-0,39",31,6000.0,"70,0","78,1","3,22","0,25","96,53",1,"17,14","4,61","0,101","0,6","0,298"
3,American Samoa,OCEANIA,57794,199,"290,4","58,29","-20,71","9,27",8000.0,"97,0","259,5",10,15,75,2,"22,46","3,27",NaN,NaN,NaN
4,Andorra,WESTERN EUROPE,71201,468,"152,1","0,00","6,6","4,05",19000.0,"100,0","497,2","2,22",0,"97,78",3,"8,71","6,25",NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
222,West Bank,NEAR EAST,2460492,5860,"419,9","0,00","2,98","19,62",800.0,NaN,"145,2","16,9","18,97","64,13",3,"31,67","3,92","0,09","0,28","0,63"
223,Western Sahara,NORTHERN AFRICA,273008,266000,"1,0","0,42",NaN,NaN,NaN,NaN,NaN,"0,02",0,"99,98",1,NaN,NaN,NaN,NaN,"0,4"
224,Yemen,NEAR EAST,21456188,527970,"40,6","0,36",0,"61,5",800.0,"50,2","37,2","2,78","0,24","96,98",1,"42,89","8,3","0,135","0,472","0,393"
225,Zambia,SUB-SAHARAN AFRICA,11502010,752614,"15,3","0,00",0,"88,29",800.0,"80,6","8,2","7,08","0,03","92,9",2,41,"19,93","0,22","0,29","0,489"
226,Zimbabwe,SUB-SAHARAN AFRICA,12236805,390580,"31,3","0,00",0,"67,69",1900.0,"90,7","26,8","8,32","0,34","91,34",2,"28,01","21,84","0,179","0,243","0,579"

In [50]:
unsorted_data['Net migration'].isnull().sum()

3

In [46]:
unsorted_data.fillna(0)

,Country,Region,Population,Area (sq. mi.),Pop. Density (per sq. mi.),Coastline (coast/area ratio),Net migration,Infant mortality (per 1000 births),GDP ($ per capita),Literacy (%),Phones (per 1000),Arable (%),Crops (%),Other (%),Climate,Birthrate,Deathrate,Agriculture,Industry,Service
0,Afghanistan,ASIA (EX. NEAR EAST),31056997,647500,"48,0","0,00","23,06","163,07",700.0,"36,0","3,2","12,13","0,22","87,65",1,"46,6","20,34","0,38","0,24","0,38"
1,Albania,EASTERN EUROPE,3581655,28748,"124,6","1,26","-4,93","21,52",4500.0,"86,5","71,2","21,09","4,42","74,49",3,"15,11","5,22","0,232","0,188","0,579"
2,Algeria,NORTHERN AFRICA,32930091,2381740,"13,8","0,04","-0,39",31,6000.0,"70,0","78,1","3,22","0,25","96,53",1,"17,14","4,61","0,101","0,6","0,298"
3,American Samoa,OCEANIA,57794,199,"290,4","58,29","-20,71","9,27",8000.0,"97,0","259,5",10,15,75,2,"22,46","3,27",0,0,0
4,Andorra,WESTERN EUROPE,71201,468,"152,1","0,00","6,6","4,05",19000.0,"100,0","497,2","2,22",0,"97,78",3,"8,71","6,25",0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
222,West Bank,NEAR EAST,2460492,5860,"419,9","0,00","2,98","19,62",800.0,0,"145,2","16,9","18,97","64,13",3,"31,67","3,92","0,09","0,28","0,63"
223,Western Sahara,NORTHERN AFRICA,273008,266000,"1,0","0,42",0,0,0.0,0,0,"0,02",0,"99,98",1,0,0,0,0,"0,4"
224,Yemen,NEAR EAST,21456188,527970,"40,6","0,36",0,"61,5",800.0,"50,2","37,2","2,78","0,24","96,98",1,"42,89","8,3","0,135","0,472","0,393"
225,Zambia,SUB-SAHARAN AFRICA,11502010,752614,"15,3","0,00",0,"88,29",800.0,"80,6","8,2","7,08","0,03","92,9",2,41,"19,93","0,22","0,29","0,489"
226,Zimbabwe,SUB-SAHARAN AFRICA,12236805,390580,"31,3","0,00",0,"67,69",1900.0,"90,7","26,8","8,32","0,34","91,34",2,"28,01","21,84","0,179","0,243","0,579"

In [59]:
unsorted_data['Net migration'].notnull().sum()

224

In [60]:
s_d=unsorted_data.dropna()

In [61]:
s_d

,Country,Region,Population,Area (sq. mi.),Pop. Density (per sq. mi.),Coastline (coast/area ratio),Net migration,Infant mortality (per 1000 births),GDP ($ per capita),Literacy (%),Phones (per 1000),Arable (%),Crops (%),Other (%),Climate,Birthrate,Deathrate,Agriculture,Industry,Service
0,Afghanistan,ASIA (EX. NEAR EAST),31056997,647500,"48,0","0,00","23,06","163,07",700.0,"36,0","3,2","12,13","0,22","87,65",1,"46,6","20,34","0,38","0,24","0,38"
1,Albania,EASTERN EUROPE,3581655,28748,"124,6","1,26","-4,93","21,52",4500.0,"86,5","71,2","21,09","4,42","74,49",3,"15,11","5,22","0,232","0,188","0,579"
2,Algeria,NORTHERN AFRICA,32930091,2381740,"13,8","0,04","-0,39",31,6000.0,"70,0","78,1","3,22","0,25","96,53",1,"17,14","4,61","0,101","0,6","0,298"
6,Anguilla,LATIN AMER. & CARIB,13477,102,"132,1","59,80","10,76","21,03",8600.0,"95,0","460,0",0,0,100,2,"14,17","5,34","0,04","0,18","0,78"
7,Antigua & Barbuda,LATIN AMER. & CARIB,69108,443,"156,0","34,54","-6,15","19,46",11000.0,"89,0","549,9","18,18","4,55","77,27",2,"16,93","5,37","0,038","0,22","0,743"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
218,Venezuela,LATIN AMER. & CARIB,25730435,912050,"28,2","0,31","-0,04","22,2",4800.0,"93,4","140,1","2,95","0,92","96,13",2,"18,71","4,92","0,04","0,419","0,541"
219,Vietnam,ASIA (EX. NEAR EAST),84402966,329560,"256,1","1,05","-0,45","25,95",2500.0,"90,3","187,7","19,97","5,95","74,08",2,"16,86","6,22","0,209","0,41","0,381"
224,Yemen,NEAR EAST,21456188,527970,"40,6","0,36",0,"61,5",800.0,"50,2","37,2","2,78","0,24","96,98",1,"42,89","8,3","0,135","0,472","0,393"
225,Zambia,SUB-SAHARAN AFRICA,11502010,752614,"15,3","0,00",0,"88,29",800.0,"80,6","8,2","7,08","0,03","92,9",2,41,"19,93","0,22","0,29","0,489"
226,Zimbabwe,SUB-SAHARAN AFRICA,12236805,390580,"31,3","0,00",0,"67,69",1900.0,"90,7","26,8","8,32","0,34","91,34",2,"28,01","21,84","0,179","0,243","0,579"

In [95]:
s_d_replaced=s_d.replace({'EASTERN EUROPE':'EE'})
s_d_replaced

,Country,Region,Population,Area (sq. mi.),Pop. Density (per sq. mi.),Coastline (coast/area ratio),Net migration,Infant mortality (per 1000 births),GDP ($ per capita),Literacy (%),Phones (per 1000),Arable (%),Crops (%),Other (%),Climate,Birthrate,Deathrate,Agriculture,Industry,Service
0,Afghanistan,ASIA (EX. NEAR EAST),31056997,647500,"48,0","0,00","23,06","163,07",700.0,"36,0","3,2","12,13","0,22","87,65",1,"46,6","20,34","0,38","0,24","0,38"
1,Albania,EASTERN EUROPE,3581655,28748,"124,6","1,26","-4,93","21,52",4500.0,"86,5","71,2","21,09","4,42","74,49",3,"15,11","5,22","0,232","0,188","0,579"
2,Algeria,NORTHERN AFRICA,32930091,2381740,"13,8","0,04","-0,39",31,6000.0,"70,0","78,1","3,22","0,25","96,53",1,"17,14","4,61","0,101","0,6","0,298"
6,Anguilla,LATIN AMER. & CARIB,13477,102,"132,1","59,80","10,76","21,03",8600.0,"95,0","460,0",0,0,100,2,"14,17","5,34","0,04","0,18","0,78"
7,Antigua & Barbuda,LATIN AMER. & CARIB,69108,443,"156,0","34,54","-6,15","19,46",11000.0,"89,0","549,9","18,18","4,55","77,27",2,"16,93","5,37","0,038","0,22","0,743"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
218,Venezuela,LATIN AMER. & CARIB,25730435,912050,"28,2","0,31","-0,04","22,2",4800.0,"93,4","140,1","2,95","0,92","96,13",2,"18,71","4,92","0,04","0,419","0,541"
219,Vietnam,ASIA (EX. NEAR EAST),84402966,329560,"256,1","1,05","-0,45","25,95",2500.0,"90,3","187,7","19,97","5,95","74,08",2,"16,86","6,22","0,209","0,41","0,381"
224,Yemen,NEAR EAST,21456188,527970,"40,6","0,36",0,"61,5",800.0,"50,2","37,2","2,78","0,24","96,98",1,"42,89","8,3","0,135","0,472","0,393"
225,Zambia,SUB-SAHARAN AFRICA,11502010,752614,"15,3","0,00",0,"88,29",800.0,"80,6","8,2","7,08","0,03","92,9",2,41,"19,93","0,22","0,29","0,489"
226,Zimbabwe,SUB-SAHARAN AFRICA,12236805,390580,"31,3","0,00",0,"67,69",1900.0,"90,7","26,8","8,32","0,34","91,34",2,"28,01","21,84","0,179","0,243","0,579"

# Group By

In [2]:
!pip install seaborn

Collecting seaborn
  Downloading seaborn-0.11.2-py3-none-any.whl (292 kB)
Requirement already satisfied: matplotlib>=2.2 in c:\users\admin\appdata\local\programs\python\python37\lib\site-packages (from seaborn) (3.2.2)
Requirement already satisfied: scipy>=1.0 in c:\users\admin\appdata\local\programs\python\python37\lib\site-packages (from seaborn) (1.5.3)
Requirement already satisfied: numpy>=1.15 in c:\users\admin\appdata\local\programs\python\python37\lib\site-packages (from seaborn) (1.21.2)
Requirement already satisfied: pandas>=0.23 in c:\users\admin\appdata\local\programs\python\python37\lib\site-packages (from seaborn) (1.1.3)
Requirement already satisfied: kiwisolver>=1.0.1 in c:\users\admin\appdata\local\programs\python\python37\lib\site-packages (from matplotlib>=2.2->seaborn) (1.1.0)
Requirement already satisfied: python-dateutil>=2.1 in c:\users\admin\appdata\local\programs\python\python37\lib\site-packages (from matplotlib>=2.2->seaborn) (2.8.1)
Requirement already satisfied: pyparsing!=2.0.4,!=2.1.2,!=2.1.6,>=2.0.1 in c:\users\admin\appdata\local\programs\python\python37\lib\site-packages (from matplotlib>=2.2->seaborn) (2.4.6)
Requirement already satisfied: cycler>=0.10 in c:\users\admin\appdata\local\programs\python\python37\lib\site-packages (from matplotlib>=2.2->seaborn) (0.10.0)
Requirement already satisfied: pytz>=2017.2 in c:\users\admin\appdata\local\programs\python\python37\lib\site-packages (from pandas>=0.23->seaborn) (2020.1)
Requirement already satisfied: setuptools in c:\users\admin\appdata\local\programs\python\python37\lib\site-packages (from kiwisolver>=1.0.1->matplotlib>=2.2->seaborn) (40.6.2)
Requirement already satisfied: six>=1.5 in c:\users\admin\appdata\local\programs\python\python37\lib\site-packages (from python-dateutil>=2.1->matplotlib>=2.2->seaborn) (1.14.0)
Installing collected packages: seaborn
Successfully installed seaborn-0.11.2

WARNING: You are using pip version 20.2.4; however, version 21.2.4 is available.
You should consider upgrading via the 'c:\users\admin\appdata\local\programs\python\python37\python.exe -m pip install --upgrade pip' command.

In [3]:
import pandas as pd 
import matplotlib.pyplot as plt
import seaborn as sns
sns.set()
%matplotlib inline

In [4]:
cars_data=pd.DataFrame({
    'Make':['Audi','Audi','Audi','BMW','BMW','BMW','Chevorlet','Chevorlet','Fiat','Fiat','Tesla','Tesla','Tesla'],
    'Model':['AB','S4','X4','X3','6Series','Blazer','Spark','124Spider','500 X','Model3','Model5','ModelX','M6'],
    'Color':['Red','Blue','Orange','Black','Green','White','Violet','Pink','Grey','Yellow','Purple','Maroon','Indigo'],
    'Quantity':['3','7','10','11','5','6','8','15','20','21','25','35','19'],
    'Price':['$12344','$4567','$567132','$78905','$21345','$23456','$49813','$421890','$37861','$19064','$289643','$234896','$356781']
})
cars_data

         Make      Model   Color Quantity    Price
0        Audi         AB     Red        3   $12344
1        Audi         S4    Blue        7    $4567
2        Audi         X4  Orange       10  $567132
3         BMW         X3   Black       11   $78905
4         BMW    6Series   Green        5   $21345
5         BMW     Blazer   White        6   $23456
6   Chevorlet      Spark  Violet        8   $49813
7   Chevorlet  124Spider    Pink       15  $421890
8        Fiat      500 X    Grey       20   $37861
9        Fiat     Model3  Yellow       21   $19064
10      Tesla     Model5  Purple       25  $289643
11      Tesla     ModelX  Maroon       35  $234896
12      Tesla         M6  Indigo       19  $356781

In [5]:
cars_data.index

RangeIndex(start=0, stop=13, step=1)

In [7]:
cars_data_index=cars_data.set_index(['Make'])
cars_data_index

               Model   Color Quantity    Price
Make
Audi              AB     Red        3   $12344
Audi              S4    Blue        7    $4567
Audi              X4  Orange       10  $567132
BMW               X3   Black       11   $78905
BMW          6Series   Green        5   $21345
BMW           Blazer   White        6   $23456
Chevorlet      Spark  Violet        8   $49813
Chevorlet  124Spider    Pink       15  $421890
Fiat           500 X    Grey       20   $37861
Fiat          Model3  Yellow       21   $19064
Tesla         Model5  Purple       25  $289643
Tesla         ModelX  Maroon       35  $234896
Tesla             M6  Indigo       19  $356781

In [8]:
cars_data_index=cars_data.set_index(['Make','Model'])
cars_data_index

                      Color Quantity    Price
Make      Model
Audi      AB            Red        3   $12344
          S4           Blue        7    $4567
          X4         Orange       10  $567132
BMW       X3          Black       11   $78905
          6Series     Green        5   $21345
          Blazer      White        6   $23456
Chevorlet Spark      Violet        8   $49813
          124Spider    Pink       15  $421890
Fiat      500 X        Grey       20   $37861
          Model3     Yellow       21   $19064
Tesla     Model5     Purple       25  $289643
          ModelX     Maroon       35  $234896
          M6         Indigo       19  $356781

In [9]:
cars_data_index.xs('BMW')

         Color Quantity   Price
Model
X3       Black       11  $78905
6Series  Green        5  $21345
Blazer   White        6  $23456

In [10]:
cars_data_index.xs('X3',level='Model')

      Color Quantity   Price
Make
BMW   Black       11  $78905

In [11]:
cars_data_index.loc['Audi':'Chevorlet',:]

                      Color Quantity    Price
Make      Model
Audi      AB            Red        3   $12344
          S4           Blue        7    $4567
          X4         Orange       10  $567132
BMW       X3          Black       11   $78905
          6Series     Green        5   $21345
          Blazer      White        6   $23456
Chevorlet Spark      Violet        8   $49813
          124Spider    Pink       15  $421890

# Merging and Joining

In [37]:
cars=pd.DataFrame({
    'Car':['Audi','WagonR','Fiat','Mercedes','BMW','NANO','Ferrari','Honda City'],
    'Color':['Red','Black','White','Blue','Green','Yellow','Purple','Blue'],
    'CarID':[1,2,3,4,5,6,7,8]
})
cars

          Car   Color  CarID
0        Audi     Red      1
1      WagonR   Black      2
2        Fiat   White      3
3    Mercedes    Blue      4
4         BMW   Green      5
5        NANO  Yellow      6
6     Ferrari  Purple      7
7  Honda City    Blue      8

In [32]:
more_cars=pd.DataFrame({
    'Car':['Alto','Etios','Volkswagon'],
    'Color':['Red','Blue','White'],
    'CarID':[12,14,15]
})
# more_cars.index=[8,9,10]
more_cars

          Car  Color  CarID
0        Alto    Red     12
1       Etios   Blue     14
2  Volkswagon  White     15

In [52]:
total_car=pd.concat([cars,more_cars],ignore_index=True)
total_car

           Car   Color  CarID
0         Audi     Red      1
1       WagonR   Black      2
2         Fiat   White      3
3     Mercedes    Blue      4
4          BMW   Green      5
5         NANO  Yellow      6
6      Ferrari  Purple      7
7   Honda City    Blue      8
8         Alto     Red     12
9        Etios    Blue     14
10  Volkswagon   White     15

# Applying Join operations on Data Frame

In [53]:
car_orders=pd.DataFrame({
    'OrderID':[201,202,203,204,205,206,207,208],
    'Quantity':[4,2,8,9,3,5,10,20],
    'CarID':[7,6,5,8,4,1,3,2]
})
car_orders

   OrderID  Quantity  CarID
0      201         4      7
1      202         2      6
2      203         8      5
3      204         9      8
4      205         3      4
5      206         5      1
6      207        10      3
7      208        20      2

In [54]:
pd.concat([cars,car_orders])   #incompatible operations

          Car   Color  CarID  OrderID  Quantity
0        Audi     Red      1      NaN       NaN
1      WagonR   Black      2      NaN       NaN
2        Fiat   White      3      NaN       NaN
3    Mercedes    Blue      4      NaN       NaN
4         BMW   Green      5      NaN       NaN
5        NANO  Yellow      6      NaN       NaN
6     Ferrari  Purple      7      NaN       NaN
7  Honda City    Blue      8      NaN       NaN
0         NaN     NaN      7    201.0       4.0
1         NaN     NaN      6    202.0       2.0
2         NaN     NaN      5    203.0       8.0
3         NaN     NaN      8    204.0       9.0
4         NaN     NaN      4    205.0       3.0
5         NaN     NaN      1    206.0       5.0
6         NaN     NaN      3    207.0      10.0
7         NaN     NaN      2    208.0      20.0

In [55]:
pd.concat([cars,car_orders],axis=1)     #CarID is duplicated

          Car   Color  CarID  OrderID  Quantity  CarID
0        Audi     Red      1      201         4      7
1      WagonR   Black      2      202         2      6
2        Fiat   White      3      203         8      5
3    Mercedes    Blue      4      204         9      8
4         BMW   Green      5      205         3      4
5        NANO  Yellow      6      206         5      1
6     Ferrari  Purple      7      207        10      3
7  Honda City    Blue      8      208        20      2

In [56]:
pd.merge(cars,car_orders,on='CarID')

          Car   Color  CarID  OrderID  Quantity
0        Audi     Red      1      206         5
1      WagonR   Black      2      208        20
2        Fiat   White      3      207        10
3    Mercedes    Blue      4      205         3
4         BMW   Green      5      203         8
5        NANO  Yellow      6      202         2
6     Ferrari  Purple      7      201         4
7  Honda City    Blue      8      204         9

In [58]:
pd.merge(total_car,car_orders,on='CarID')

          Car   Color  CarID  OrderID  Quantity
0        Audi     Red      1      206         5
1      WagonR   Black      2      208        20
2        Fiat   White      3      207        10
3    Mercedes    Blue      4      205         3
4         BMW   Green      5      203         8
5        NANO  Yellow      6      202         2
6     Ferrari  Purple      7      201         4
7  Honda City    Blue      8      204         9

In [59]:
pd.merge(total_car,car_orders,on='CarID',how='left')

           Car   Color  CarID  OrderID  Quantity
0         Audi     Red      1    206.0       5.0
1       WagonR   Black      2    208.0      20.0
2         Fiat   White      3    207.0      10.0
3     Mercedes    Blue      4    205.0       3.0
4          BMW   Green      5    203.0       8.0
5         NANO  Yellow      6    202.0       2.0
6      Ferrari  Purple      7    201.0       4.0
7   Honda City    Blue      8    204.0       9.0
8         Alto     Red     12      NaN       NaN
9        Etios    Blue     14      NaN       NaN
10  Volkswagon   White     15      NaN       NaN

In [60]:
pd.merge(total_car,car_orders,on='CarID',how='right')    #Inner Join Operations

          Car   Color  CarID  OrderID  Quantity
0     Ferrari  Purple      7      201         4
1        NANO  Yellow      6      202         2
2         BMW   Green      5      203         8
3  Honda City    Blue      8      204         9
4    Mercedes    Blue      4      205         3
5        Audi     Red      1      206         5
6        Fiat   White      3      207        10
7      WagonR   Black      2      208        20

In [61]:
pd.merge(total_car,car_orders,on='CarID',how='outer')

           Car   Color  CarID  OrderID  Quantity
0         Audi     Red      1    206.0       5.0
1       WagonR   Black      2    208.0      20.0
2         Fiat   White      3    207.0      10.0
3     Mercedes    Blue      4    205.0       3.0
4          BMW   Green      5    203.0       8.0
5         NANO  Yellow      6    202.0       2.0
6      Ferrari  Purple      7    201.0       4.0
7   Honda City    Blue      8    204.0       9.0
8         Alto     Red     12      NaN       NaN
9        Etios    Blue     14      NaN       NaN
10  Volkswagon   White     15      NaN       NaN

In [62]:
pd.merge(total_car,car_orders,on='CarID',how='inner')

          Car   Color  CarID  OrderID  Quantity
0        Audi     Red      1      206         5
1      WagonR   Black      2      208        20
2        Fiat   White      3      207        10
3    Mercedes    Blue      4      205         3
4         BMW   Green      5      203         8
5        NANO  Yellow      6      202         2
6     Ferrari  Purple      7      201         4
7  Honda City    Blue      8      204         9

# SQL

In [63]:
import pandas as pd
import sys
import sqlite3

In [64]:
connection=sqlite3.connect('./EmpData.db')

In [65]:
cursor=connection.cursor()

In [68]:
emp_table="""CREATE TABLE EMPLOYEE(
                                    ID_No VARCHAR(10) PRIMARY KEY,
                                    F_NAME VARCHAR(12),
                                    L_NAME VARCHAR(12),
                                    DEPTT VARCHAR(15),
                                    GENDER CHAR(10),
                                    CITY VARCHAR(40)
                                    );"""

In [69]:
cursor.execute(emp_table)

In [70]:
cursor.execute(emp_table)

OperationalError: table EMPLOYEE already exists

In [72]:
insert_emp="""INSERT INTO EMPLOYEE VALUES('ID_1','Rahul','Prabhu','EXTC','Male','Mumbai')"""
cursor.execute(insert_emp)

In [73]:
insert_emp="""INSERT INTO EMPLOYEE VALUES('ID_2','Ram','Yadav','CS','Male','Mumbai')"""
cursor.execute(insert_emp)

In [74]:
insert_emp="""INSERT INTO EMPLOYEE VALUES('ID_3','Leander','Paes','Tennis','Male','Kolkata')"""
cursor.execute(insert_emp)

In [75]:
insert_emp="""INSERT INTO EMPLOYEE VALUES('ID_4','Sita','Ramaraju','Movies','FeMale','Hyderabad')"""
cursor.execute(insert_emp)

In [76]:
insert_emp="""INSERT INTO EMPLOYEE VALUES('ID_5','Akanksha','Khanvilkar','EXTC','Female','Mumbai')"""
cursor.execute(insert_emp)

In [77]:
connection.commit()
cursor.execute('SELECT * FROM EMPLOYEE')

In [78]:
employee_data=cursor.fetchall()
employee_data

[('ID_1', 'Rahul', 'Prabhu', 'EXTC', 'Male', 'Mumbai'),
 ('ID_2', 'Ram', 'Yadav', 'CS', 'Male', 'Mumbai'),
 ('ID_3', 'Leander', 'Paes', 'Tennis', 'Male', 'Kolkata'),
 ('ID_4', 'Sita', 'Ramaraju', 'Movies', 'FeMale', 'Hyderabad'),
 ('ID_5', 'Akanksha', 'Khanvilkar', 'EXTC', 'Female', 'Mumbai')]

In [85]:
employee_df=pd.DataFrame(list(employee_data),columns=['ID_No','First Name','Last Name','Branch','Gender','Location'])
employee_df

  ID_No First Name   Last Name  Branch  Gender   Location
0  ID_1      Rahul      Prabhu    EXTC    Male     Mumbai
1  ID_2        Ram       Yadav      CS    Male     Mumbai
2  ID_3    Leander        Paes  Tennis    Male    Kolkata
3  ID_4       Sita    Ramaraju  Movies  FeMale  Hyderabad
4  ID_5   Akanksha  Khanvilkar    EXTC  Female     Mumbai

In [86]:
connection.close()

In [87]:
cursor.execute('SELECT * FROM EMPLOYEE')

ProgrammingError: Cannot operate on a closed database.